# TemperatureRating Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireType..::..TemperatureRating Property
WireType Class See Also
---
The temperature rating type of the wire type.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public TemperatureRatingType TemperatureRating { get; set; }
```

Visual Basic
---
```text
Public Property TemperatureRating As TemperatureRatingType
	Get
	Set
```

Visual C++
---
```text
public:
property TemperatureRatingType^ TemperatureRating {
	TemperatureRatingType^ get ();
	void set (TemperatureRatingType^ value);
}
```

# Remarks
Should retrieved from relevant WireMaterial object.
# See Also
WireType Class
Autodesk.Revit.DB.Electrical Namespace